Revit 2024 API
ConnectionInputPointInfo Class
 An object that holds description information about a connection input point
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class ConnectionInputPointInfo : IDisposable
Visual Basic
Public Class ConnectionInputPointInfo _
	Implements IDisposable
Visual C++
public ref class ConnectionInputPointInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ConnectionInputPointInfo
See Also
ConnectionInputPointInfo Members
Autodesk.Revit.DB.Structure Namespace